{
  "architectures": [
    "EncoderDecoderModel"
  ],
  "decoder": {
    "_name_or_path": "skt/kogpt2-base-v2",
    "_num_labels": 1,
    "activation_function": "gelu_new",
    "add_cross_attention": true,
    "architectures": [
      "GPT2LMHeadModel"
    ],
    "attn_pdrop": 0.1,
    "author": "Heewon Jeon(madjakarta@gmail.com)",
    "bos_token_id": 0,
    "created_date": "2021-04-28",
    "embd_pdrop": 0.1,
    "eos_token_id": 1,
    "gradient_checkpointing": false,
    "id2label": {
      "0": "LABEL_0"
    },
    "initializer_range": 0.02,
    "is_decoder": true,
    "label2id": {
      "LABEL_0": 0
    },
    "layer_norm_epsilon": 1e-05,
    "license": "CC-BY-NC-SA 4.0",
    "model_type": "gpt2",
    "n_ctx": 1024,
    "n_embd": 768,
    "n_head": 12,
    "n_inner": null,
    "n_layer": 12,
    "n_positions": 1024,
    "pad_token_id": 3,
    "reorder_and_upcast_attn": false,
    "resid_pdrop": 0.1,
    "scale_attn_by_inverse_layer_idx": false,
    "scale_attn_weights": true,
    "summary_activation": null,
    "summary_first_dropout": 0.1,
    "summary_proj_to_labels": true,
    "summary_type": "cls_index",
    "summary_use_proj": true,
    "task_specific_params": {
      "text-generation": {
        "do_sample": true,
        "max_length": 50
      }
    },
    "torch_dtype": "float32",
    "use_cache": true,
    "vocab_size": 51200
  },
  "decoder_start_token_id": 0,
  "encoder": {
    "_name_or_path": "cl-tohoku/bert-base-japanese-v2",
    "architectures": [
      "BertForMaskedLM"
    ],
    "attention_probs_dropout_prob": 0.1,
    "classifier_dropout": null,
    "hidden_act": "gelu",
    "hidden_dropout_prob": 0.1,
    "hidden_size": 768,
    "initializer_range": 0.02,
    "intermediate_size": 3072,
    "layer_norm_eps": 1e-12,
    "max_position_embeddings": 512,
    "model_type": "bert",
    "num_attention_heads": 12,
    "num_hidden_layers": 12,
    "position_embedding_type": "absolute",
    "tokenizer_class": "BertJapaneseTokenizer",
    "torch_dtype": "float32",
    "type_vocab_size": 2,
    "use_cache": true,
    "vocab_size": 32768
  },
  "is_encoder_decoder": true,
  "model_type": "encoder-decoder",
  "pad_token_id": 3,
  "torch_dtype": "float32",
  "transformers_version": "4.51.3"
}
